#List and String Comparison
#แบบฝึกหัด 3-3 ข้อที่ 1
#การเปรียบเทียบลิสต์กับลิสต์
# แสดงผลของการเปรียบเทียบว่า s เป็น
#   สตริงที่ขึ้นต้นด้วยตัวอักษรอังกฤษตัวใหญ่ 
#   และลงท้ายด้วยตัวเลข
s = ["A","C","Y","U","0","5","6"]
print("A" <= s[0] <= "Z" and "0" <= s[-1] <= "9")

#มีตัวแปร d1, m1, y1 กับ d2, m2, y2 
#ให้แล้ว เก็บวันเดือนปีเกิดของ Tom กับ Jerry ตามลำดับ 
#จงแสดงว่า Tom หรือ Jerry ใครเกิดก่อน (ให้ถือว่าไม่มีกรณีเกิดวันเดือนปีเดียวกัน)
Tom = input()
Jerry = input()
x = Tom.split()
y = Jerry.split()
y1 = int(x[0])
m1 = int(x[1])
d1 = int(x[2])
y2 = int(y[0])
m2 = int(y[1])
d2 = int(y[2])

if [y1,m1,d1] < [y2,m2,d2]:
  print("Tom")
else:
  print("Jerry")